---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetSizeCount(System.String)
source: html/cc196c19-2cb5-9120-879d-12053637af11.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettings.GetSizeCount Method

Gets the size count of the conduit size table. The conduit standard name the location of the size in the size table.

## Syntax (C#)
```csharp
public int GetSizeCount(
	string standardName
)
```

## Parameters
- **standardName** (`System.String`) - The conduit standard name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null